Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLineAttributes.OffsetAtStartOfLine Property
 The offset for the beginning of the grid line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double OffsetAtStartOfLine { get; set; }
Public Property OffsetAtStartOfLine As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GridLine.GridLineAttributes Class
Tekla.Structures.Drawing Namespace